{
  "_name_or_path": "nielsr/layoutlmv3-finetuned-funsd",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-HOLDER_NAME",
    "2": "I-HOLDER_NAME",
    "3": "B-ORGANIZATION",
    "4": "I-ORGANIZATION",
    "5": "B-DOCUMENT_NUMBER",
    "6": "I-DOCUMENT_NUMBER",
    "7": "B-ISSUE_DATE",
    "8": "I-ISSUE_DATE",
    "9": "B-EXPIRY_DATE",
    "10": "I-EXPIRY_DATE",
    "11": "B-DATE_OF_BIRTH",
    "12": "I-DATE_OF_BIRTH",
    "13": "B-DOCUMENT_TITLE",
    "14": "I-DOCUMENT_TITLE",
    "15": "B-TOTAL_AMOUNT",
    "16": "I-TOTAL_AMOUNT",
    "17": "B-NATIONALITY",
    "18": "I-NATIONALITY",
    "19": "B-EMAIL",
    "20": "I-EMAIL",
    "21": "B-SKILL",
    "22": "I-SKILL",
    "23": "B-INSURANCE_COMPANY",
    "24": "I-INSURANCE_COMPANY",
    "25": "B-PROVIDER_NAME",
    "26": "I-PROVIDER_NAME",
    "27": "B-GENDER",
    "28": "I-GENDER",
    "29": "B-ADDRESS",
    "30": "I-ADDRESS",
    "31": "B-FATHER_NAME",
    "32": "I-FATHER_NAME"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-ADDRESS": 29,
    "B-DATE_OF_BIRTH": 11,
    "B-DOCUMENT_NUMBER": 5,
    "B-DOCUMENT_TITLE": 13,
    "B-EMAIL": 19,
    "B-EXPIRY_DATE": 9,
    "B-FATHER_NAME": 31,
    "B-GENDER": 27,
    "B-HOLDER_NAME": 1,
    "B-INSURANCE_COMPANY": 23,
    "B-ISSUE_DATE": 7,
    "B-NATIONALITY": 17,
    "B-ORGANIZATION": 3,
    "B-PROVIDER_NAME": 25,
    "B-SKILL": 21,
    "B-TOTAL_AMOUNT": 15,
    "I-ADDRESS": 30,
    "I-DATE_OF_BIRTH": 12,
    "I-DOCUMENT_NUMBER": 6,
    "I-DOCUMENT_TITLE": 14,
    "I-EMAIL": 20,
    "I-EXPIRY_DATE": 10,
    "I-FATHER_NAME": 32,
    "I-GENDER": 28,
    "I-HOLDER_NAME": 2,
    "I-INSURANCE_COMPANY": 24,
    "I-ISSUE_DATE": 8,
    "I-NATIONALITY": 18,
    "I-ORGANIZATION": 4,
    "I-PROVIDER_NAME": 26,
    "I-SKILL": 22,
    "I-TOTAL_AMOUNT": 16,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.40.0",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
